Julianiolo/ATmega32u4_Emulator/src/components/DataSpace.cpp
#include "DataSpace.h"

#include <iostream>

#include "../ATmega32u4.h"
#include "../extras/Debugger.h"

#include "../utils/bitMacros.h"

#include "CPUTemplates.h" // for addCycles (EEPROM)



A32u4::DataSpace::Timers::Timers(ATmega32u4* mcu) : mcu(mcu), lastCounter(0)
{

}

void A32u4::DataSpace::Timers::reset() {
	timer0_presc_cache = 0;
	lastCounter = 0;
	lastTimer0Update = 0;
}

void A32u4::DataSpace::Timers::update() {
	abort();
#define USE_TIM0_CACHE 1

#if 1
#if USE_TIM0_CACHE
	if (timer0_presc_cache == 3) {
#else
	if ((mcu->dataspace.data[A32u4::DataSpace::Consts::TCCR0B] & 0b111) == 3) {
#endif
		goto fast_goto_64;
	}
#endif

	bool doTick;
#if USE_TIM0_CACHE
	switch (timer0_presc_cache) {
#else
	switch (mcu->dataspace.data[A32u4::DataSpace::Consts::TCCR0B] & 0b111) {
#endif
	case 0:
		doTick = false; break;
	case 1:
		doTick = true; break;
	case 2:
		doTick = ((uint32_t)mcu->cpu.totalCycls / 8) != lastCounter;
		lastCounter = (uint32_t)mcu->cpu.totalCycls / 8;
		break;
	case 3:
#if 1
		fast_goto_64:
		doTick = ((uint32_t)mcu->cpu.totalCycls / 64) != lastCounter;
		lastCounter = (uint32_t)mcu->cpu.totalCycls / 64;
#else
		{
			uint64_t val = mcu->cpu.totalCycls / 64;
			doTick = val != lastCounter;
			lastCounter = val;
		}
#endif
		break;
	case 4:
		doTick = ((uint32_t)mcu->cpu.totalCycls / 256) != lastCounter;
		lastCounter = (uint32_t)mcu->cpu.totalCycls / 256;
		break;
	case 5:
		doTick = ((uint32_t)mcu->cpu.totalCycls / 1024) != lastCounter;
		lastCounter = (uint32_t)mcu->cpu.totalCycls / 1024;
		break;
	default:
		abort();
	}

	//uint8_t& mcu->dataspace.data[A32u4::DataSpace::Consts::TIFR0] = mcu->dataspace.getByteRefAtAddr(TIFR0);

	if (doTick) {
#if 1
		if (isBitSetNB(mcu->dataspace.data[DataSpace::Consts::PRR0], 5)) {
#else
		if (isBitSetNB(REF_PRR0, 5)) {
#endif
			return;
		}
		uint8_t& timer0 = mcu->dataspace.getByteRefAtAddr(DataSpace::Consts::TCNT0);
		timer0++;
		if (timer0 == 0) {	
			mcu->dataspace.data[A32u4::DataSpace::Consts::TIFR0] |= (1 << DataSpace::Consts::TIFR0_TOV0); // set TOV0 in TIFR0
			goto direct_intr;
		}
	}

	if (mcu->dataspace.data[A32u4::DataSpace::Consts::TIFR0] & (1 << DataSpace::Consts::TIFR0_TOV0)) {
		direct_intr:
		if (mcu->dataspace.getByteRefAtAddr(DataSpace::Consts::TIMSK0) & (1 << DataSpace::Consts::TIMSK0_TOIE0)) {
			if (mcu->dataspace.getByteRefAtAddr(DataSpace::Consts::SREG) & (1 << DataSpace::Consts::SREG_I)) {
				//mcu->cpu.queueInterrupt(23); // 0x2E timer0 overflow interrupt vector
				mcu->dataspace.data[A32u4::DataSpace::Consts::TIFR0] &= ~(1 << DataSpace::Consts::TIFR0_TOV0);
				mcu->cpu.directExecuteInterrupt(23);
			}
		}
	}
}

void A32u4::DataSpace::Timers::doTick(uint8_t& timer) {
#if 1
	if (isBitSetNB(mcu->dataspace.data[DataSpace::Consts::PRR0], 5)) {
#else
	if (isBitSetNB(REF_PRR0, 5)) {
#endif
		return;
	}
	timer++;
	if (timer == 0) {
		mcu->dataspace.data[A32u4::DataSpace::Consts::TIFR0] |= (1 << DataSpace::Consts::TIFR0_TOV0); // set TOV0 in TIFR0
		//printf("OVERFLOW at %llu\n", mcu->cpu.totalCycls);
	}

	markTimer0Update();


	//static uint64_t last = 0;
	//uint64_t diff = mcu->cpu.totalCycls - last;
	//printf("%llu\n", diff);
	//last = mcu->cpu.totalCycls;


}
void A32u4::DataSpace::Timers::doTicks(uint8_t num) {
#if 1
	if (isBitSetNB(mcu->dataspace.data[DataSpace::Consts::PRR0], 5)) {
#else
	if (isBitSetNB(REF_PRR0, 5)) {
#endif
		return;
	}

	uint8_t& timer0 = mcu->dataspace.getByteRefAtAddr(DataSpace::Consts::TCNT0);
	uint8_t tim_copy = timer0;
	timer0 += num;
	if (timer0 < tim_copy) {
		mcu->dataspace.data[A32u4::DataSpace::Consts::TIFR0] |= (1 << DataSpace::Consts::TIFR0_TOV0); // set TOV0 in TIFR0
		//printf("OVERFLOW at %llu\n", mcu->cpu.totalCycls);
	}

	markTimer0Update();
}

void A32u4::DataSpace::Timers::checkForIntr() {
	if (mcu->dataspace.data[A32u4::DataSpace::Consts::TIFR0] & (1 << DataSpace::Consts::TIFR0_TOV0)) {
		//std::cout << mcu->cpu.totalCycls << std::endl;
		if (mcu->dataspace.getByteRefAtAddr(DataSpace::Consts::TIMSK0) & (1 << DataSpace::Consts::TIMSK0_TOIE0)) {
			if (mcu->dataspace.sreg[DataSpace::Consts::SREG_I]) {
				//mcu->cpu.queueInterrupt(23); // 0x2E timer0 overflow interrupt vector
				mcu->dataspace.data[A32u4::DataSpace::Consts::TIFR0] &= ~(1 << DataSpace::Consts::TIFR0_TOV0);
				mcu->cpu.directExecuteInterrupt(23);
				//printf("int at %llu\n", mcu->cpu.totalCycls);
			}
		}
	}
}
uint8_t A32u4::DataSpace::Timers::getTimer0Presc() const {
	return timer0_presc_cache;
}
uint16_t A32u4::DataSpace::Timers::getTimer0PrescDiv() const {
	return DataSpace::Timers::presc[getTimer0Presc()];
}
void A32u4::DataSpace::Timers::markTimer0Update() { 
	// functions is supposed to set lastTimer0Update to the exact technically correct value, even if we are already past that
	uint64_t diff = mcu->cpu.totalCycls - lastTimer0Update;
	diff = (diff / getTimer0PrescDiv()) * getTimer0PrescDiv();
	lastTimer0Update += diff;
	//if(print)
	//	printf("marked at %llu\n", lastTimer0Update);
}



/*

DataSpace:

*/

A32u4::DataSpace::DataSpace(ATmega32u4* mcu) : mcu(mcu), 
#if USE_HEAP
data(new uint8_t[Consts::data_size]), eeprom(new uint8_t[Consts::eeprom_size]),
#endif
timers(mcu)
{
#if 1
	std::memset(data, 0, Consts::data_size);
	std::memset(eeprom, 0, Consts::eeprom_size);
#endif
}

A32u4::DataSpace::~DataSpace() {
#if USE_HEAP
	delete[] data;
	delete[] eeprom;
#endif
}

A32u4::DataSpace::DataSpace(const DataSpace& src): 
#if USE_HEAP
data(new uint8_t[Consts::data_size]), eeprom(new uint8_t[Consts::eeprom_size]),
#endif
timers(src.timers)
{
	operator=(src);
}
A32u4::DataSpace& A32u4::DataSpace::operator=(const DataSpace& src){
	std::memcpy(data, src.data, Consts::data_size);
	std::memcpy(eeprom, src.eeprom, Consts::eeprom_size);

	std::memcpy(sreg, src.sreg, 8);

	abort();
}

void A32u4::DataSpace::reset() {
	resetIO();
	timers.reset();
	lastEECR_EEMPE_set = 0;
	lastPLLCSR_PLLE_set = 0;

	std::memset(sreg, 0, 8); // reset sreg cache
}
void A32u4::DataSpace::resetIO() {
	//add: set all IO Registers to initial Values
	for (size_t i = 0; i < Consts::io_size; i++) {
		data[Consts::io_start + i] = 0;
	}
	for (size_t i = 0; i < Consts::ext_io_size; i++) {
		data[Consts::ext_io_start + i] = 0;
	}
	for (size_t i = 0; i < Consts::eeprom_size; i++) {
		eeprom[i] = 0;
	}

	setSP(Consts::SP_initaddr);
}

MCU_INLINE uint8_t& A32u4::DataSpace::getByteRefAtAddr(uint16_t addr) {
	A32U4_ASSERT_INRANGE_M(addr, 0, Consts::data_size, "getByteRef addr out of bounds: " + std::to_string(addr), "DataSpace", return errorIndicator);
	return data[addr];
}
MCU_INLINE uint8_t& A32u4::DataSpace::getGPRegRef(uint8_t ind) {
	A32U4_ASSERT_INRANGE_M(ind, 0, Consts::GPRs_size, "General Purpouse Register Index out of bounds: " + std::to_string((int)ind), "DataSpace", return errorIndicator);
	return data[ind];
}
MCU_INLINE uint8_t A32u4::DataSpace::getGPReg(uint8_t ind) const {
	A32U4_ASSERT_INRANGE_M(ind, 0, Consts::GPRs_size, "General Purpouse Register Index out of bounds: " + std::to_string((int)ind), "DataSpace", return 0);
	return data[ind];
}
MCU_INLINE void A32u4::DataSpace::setGPReg(uint8_t ind, reg_t val) {
	A32U4_ASSERT_INRANGE_M(ind, 0, Consts::GPRs_size, "General Purpouse Register Index out of bounds: " + std::to_string((int)ind), "DataSpace", return);
	data[ind] = val;
}

